zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_sdmmc.c
      pLinkedList->pTailNode = prev_node;
    }
  }
  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Lock Linked List Node
  * @param  pNode: Pointer to node to lock.
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_LockNode(SDMMC_DMALinkNodeTypeDef *pNode)
{

  if (pNode == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pNode->IDMALAR, SDMMC_IDMALAR_ABR, 0U);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Unlock Linked List Node
  * @param  pNode: Pointer to node to unlock.
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_UnlockNode(SDMMC_DMALinkNodeTypeDef *pNode)
{

  if (pNode == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pNode->IDMALAR, SDMMC_IDMALAR_ABR, SDMMC_IDMALAR_ABR);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Enable Linked List circular mode
  * @param  pLinkedList: Pointer to the linkedlist that contains transfer nodes
  * @retval Error status

  */
uint32_t SDMMC_DMALinkedList_EnableCircularMode(SDMMC_DMALinkedListTypeDef *pLinkedList)
{

  if (pLinkedList == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pLinkedList->pTailNode->IDMALAR, SDMMC_IDMALAR_ULA | SDMMC_IDMALAR_IDMALA, SDMMC_IDMALAR_ULA);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Disable DMA Linked List Circular mode
  * @param  pLinkedList: Pointer to the linkedlist that contains transfer nodes
  * @retval Error status
   */
uint32_t SDMMC_DMALinkedList_DisableCircularMode(SDMMC_DMALinkedListTypeDef *pLinkedList)
{

  if (pLinkedList == NULL)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }

  MODIFY_REG(pLinkedList->pTailNode->IDMALAR, SDMMC_IDMALAR_ULA, 0U);

  return SDMMC_ERROR_NONE;
}

/**
  * @}
  */


/* Private function ----------------------------------------------------------*/
/** @addtogroup SD_Private_Functions
  * @{
  */

/**
  * @brief  Checks for error conditions for CMD0.
  * @param  hsd: SD handle
  * @retval SD Card error state
  */
static uint32_t SDMMC_GetCmdError(SDMMC_TypeDef *SDMMCx)
{
  /* 8 is the number of required instructions cycles for the below loop statement.
  The SDMMC_CMDTIMEOUT is expressed in ms */
  uint32_t count = SDMMC_CMDTIMEOUT * (SystemCoreClock / 8U / 1000U);

  do
  {
    if (count-- == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }

  } while (!__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CMDSENT));

  /* Clear all the static flags */
  __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);

  return SDMMC_ERROR_NONE;
}

/**
  * @}
  */

#endif /* HAL_SD_MODULE_ENABLED || HAL_MMC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
